{
  "publishedAt": "3rd Aug 2022",
  "title": "Acoustic vs Digital Piano",
  "content": "**Which would be a better buy? An acoustic or a digital piano?**\n\nBefore anything else, let me give you my definition of what a digital piano really is. Although some electronic musical instruments can also reproduce the sound of a piano (examples are music workstations, sound modules, sample-based synthesizers, software and hardware samplers), this article refers to a digital piano as an instrument that integrates a *keyboard controller* with a *sample playback device* that specializes in piano sounds. Digital pianos vary in shapes and sizes. Some (like the ones designed for home use) may resemble the look of an upright acoustic piano. But others may resemble the look of modern synthesizers or music workstations. These are called stages pianos. They are generally lighter since they don't usually include internal loudspeakers and amplification.\n\nIf you were to ask me the above question 20 years ago (when our home piano was still brand new and digital pianos sounded crappy), I may had answered acoustic piano. But today, with the advent of modern and state-of-the-art sampling technologies I may have changed my mind. Especially now that our home piano started to show some signs of wear, such as broken strings, worn out keys, and detuning (my brother somehow got tired of constantly doing tuning jobs). Furthermore, the modern digital piano has become more and more similar to its acoustic counterpart both in sound and feel. Most of them utilize multi-sampled piano sounds. This means that samples are recorded from a real piano at different levels of loudness, so that if you lightly press a key in a digital piano, the soft recording is sounded. If you pound on the keys, the loud sample is used instead. This is necessary because in a real piano, the timbre and not just the loudness changes with the pressure applied to the keys. Some newer models even have different sets of samples for each key in the piano. And still others produce even the most intricate sounds of the piano's internal machinery such as a hint of a hammer striking the string, the delicate sound produce by the keys as you release them, and even the discrete sound of the damper pedal being depressed or released. All these combine to produce an amazingly realistic piano sound. Most models may also likely to incorporate graded hammer action. This simply means that the keys progressively become heavier as you go down the lower pitched keys - much like in the real acoustic piano - for more expressive playing.\n\nSome experts may argue that acoustic pianos sound better than their digital counterpart. But for the untrained ear (and admit it, most of us are) the difference is not at all noticeable, especially in recorded music. Some newer and more expensive models of digital piano such as Roland's KR series even went to the extent of sampling *string harmonics*, and even include an actual soundboard to faithfully capture the vibrance of a real concert grand. With these recent developments, a question arises: What set these two types of pianos apart? This article tries to point out the advantages and downsides of using each type of model which may guide newbie piano buyers what model to choose.\n\n**DIGITAL PIANOS**\n\nLet me point out that the *extreme* digital piano features explained above may only be present in newer and more expensive models. If you are an amateur digital piano buyer and looking for an entry level model (or a used one), chances are, these may fall short of the genuine article. Nevertheless, most digital pianos have certain advantages over the real one. These include the following:\n\n* **Digital pianos are generally less expensive.** So if your on a budget, a digital piano may be the right one for you.\n* **They are generally lighter and more compact.** If room space is your concern, then you may choose to have a digital piano. Also, if you are a gigging musician, it is easier to transport a digital stage piano. It fits nicely at the backseat or even the trunk of most cars.\n* **They do not require tuning.** As with most string instruments, an acoustic piano lacks the ability to stay in tune. Tuning the piano yourself is a painstaking process and hiring somebody to do it means additional expense for you. On this aspect, a digital piano is a better choice.\n* **They may include many more instrument sounds.** You are not limited with only one piano sound. These may include different types of piano sounds such as modern pianos, electric pianos such as Rhodes, as well as organ, guitar, and string sounds. It may also be possible to layer two or more sounds together to produce some interesting effects. Some newer models even include hundreds more sounds and act as music workstations.\n* **They may incorporate a MIDI implementation.** MIDI stands for Musical Instrument Digital Interface, a technology that was created in the 1980's that provides various digital musical instruments and computers a standard way to communicate with each other. What this does is that it allows you to expand the capabilities of your digital piano by connecting it to external sound modules, sequencers, and computers. It also lets you playback standard MIDI files - available from various locations - on your piano making it act as a pianolla without the bulky and ungainly roll of punched paper.\n* **They may provide a way to record and store your performances.** Most models of digital pianos have built in sequencers with at least two tracks. So that if you have a sudden surge of inspiration, you can instantly record your music and store it (on disk, smart media, or to your computer) and play it back at a later time.\n* **They may include a interactive learning assist feature.** This is useful for those beginning to learn how to play piano. Eliminating the need for a piano teacher. (Bad news for them.) If you are a beginner, try asking your piano dealer what models have this feature.\n* **They usually include headphone output.** If you suddenly feel a surge of inspiration in the middle of the night, you need not worry that you might wake up other members of your household or even your neighbors.\n* **They often have a transposition feature.** Now this is what I like about digital musical instruments because I always hated having to manually transpose a tune. With this feature, you could play a tune in a convenient key but actually heard in another.\n* **They almost always include an audio output.** This eliminates the use of microphones when recording your music and the problems associated with them like feedbacks and noises. This greatly simplifies the recording process.\n\nSome of the features may or may not be included in some models. Just ask your music dealer about them.\n\n**ACOUSTIC PIANOS**\n\nI can not say much about acoustic pianos. But this does not mean that I am bias about digital pianos. Acoustic pianos also have advantages over the digital piano. Foremost of them is the sound quality. Experts will definitely argue that the acoustic piano sounds infinitely better than its digital counterpart. The reason for this is that there are crucial physical and mathematical aspects of an acoustic piano that are difficult if not impossible to accurately duplicate in digital format.\n\nAn example is when the damper pedals are depressed, the keys that are not struck *vibrate sympathetically* when other keys are struck. This have the effect of having a fuller more resonant sound in acoustic pianos. (Although, as mentioned earlier in this article, progress is being made in digital music to emulate sympathetic vibrations and string harmonics.)\n\nAnother aspect where acoustic pianos are better than digital ones is its unlimited polyphony. Polyphony refers to the number of notes that can sound simultaneously. Digital pianos have limited polyphony which tend to become a problem when executing complex and *thick* passages especially if the damper pedals are depressed. (Digital piano polyphony ranges from 32 to 120 notes. But of course, progress is also being made to extend this limit.\n\nFurthermore, acoustic pianos doesn't need electric power to function. So you can still enjoy playing your instrument even when there is no available electrical power. In our village in the Philippines where power outages often occur, this aspect proved to be a great advantage.\n\nLastly, acoustic pianos generally last longer. (Although some may argue otherwise.) I once came across a hundred-year-old piano and it is still playable. The reason is that even old and worn out pianos can be reconditioned by replacing a number of parts, and may be made to sound as good as new pianos. Although older pianos tend to sound warmer. I don't know if the same can be said about digital pianos. Technology progresses at a fast pace and this sometimes becomes a disadvantage. To accommodate the manufacture of newer chips, they may stop making the older models. For example, if you bought a synth 20 years ago, chances are it would be difficult for you to find spare parts now, or even a technician who knows the technology. You end up buying a newer model.\n\nI hope this article will help you in deciding what instrument you would choose - digital or acoustic piano. Whatever choice you make, I hope you enjoy making music with your preferred instrument."
}